Public Attributes | List of all members
API_StairMonolithStructureSymbolData Struct Reference
Element Manager
>Represents the data of a monolith Stair's Structure elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_AttributeIndex  | goingLineType
 short  | goingLinePen
 short  | goingNosingLinePen
 API_AttributeIndex  | goingNosingLineType
 API_AttributeIndex  | connectionLineType
 short  | connectionLinePen
 short  | connectionDetailLinePen
 API_AttributeIndex  | connectionDetailLineType
 API_AttributeIndex  | drainingFillType
 short  | drainingFillPen
 short  | drainingFillBackGroundPen
 API_AttributeIndex  | contourLineType
 short  | contourLinePen
Detailed Description
>Represents the data of a monolith Stair's Structure elements.